! ==============================================================================
! Program       : ABC450_B_Fortran_v1 (f90)
! ------------------------------------------------------------------------------
! Problem       : Split Ticketing
! Contest       : ABC450 B (2026/03/21)
!
! Author        : Scienttysburg
! Creation Date : 2026/04/09
! Last Modified : 2026/04/09
! Version       : 1.0.1
! ==============================================================================
program ABC450_B_Fortran_v1
  ! ============================================================================
  implicit none
  ! --- Constants / Parameters -------------------------------------------------
  integer(8), parameter :: MAX_N = 100_8
  ! --- Input Data -------------------------------------------------------------
  integer(8)            :: N
  integer(8)            :: cost(1:MAX_N, 1:MAX_N)
  ! --- Work Variables / Internal State ----------------------------------------
  logical               :: found
  ! --- Loop Counters ----------------------------------------------------------
  integer(8)            :: i, j, a, b, c
  ! ============================================================================

  ! === Input ==================================================================
  read(*,*) N
  do i = 1_8, N-1_8
    read(*,*) (cost(i, j), j = i+1_8, N)
  end do

  ! === Calculate ==============================================================
  ! 迂回ルート(a -> b -> c)の方が、直行ルート(a -> c)より低コストになるか判定する
  found = .false.
  outer : &
  do a = 1_8, N-2_8
    do b = a+1_8, N-1_8
      do c = b+1_8, N
        if(cost(a, b) + cost(b, c) < cost(a, c))then
          found = .true.
          exit outer
        end if
      end do
    end do
  end do outer

  ! === Results ================================================================
  if(found)then
    write(*,'(A)') 'Yes'
  else
    write(*,'(A)') 'No'
  end if

! ==============================================================================
end program ABC450_B_Fortran_v1